from pandas import DataFrame

data1 = {
    '시가': [980, 200, 300],
    '고가': [990, 300, 500],
    '저가': [920, 180, 300],
    '종가': [930, 180, 400]
}
index1 = ['비트코인', '리플', '이더리움']

data2 = [
    [980, 990, 920, 930],
    [200, 300, 180, 180],
    [300, 500, 300, 400]
]
index2 = ['비트코인', '리플', '이더리움']
column2 = ['시가', '고가', '저가', '종가']

data3 = [
    {'시가': 980, '고가': 990, '저가': 920, '종가': 930},
    {'시가': 200, '고가': 300, '저가': 180, '종가': 180},
    {'시가': 300, '고가': 500, '저가': 300, '종가': 400},
]
index3 = ['비트코인', '리플', '이더리움']

df1 = DataFrame(data1, index1)
df2 = DataFrame(data2, index2, column2)
df3 = DataFrame(data3, index3)
DataFrame()

print(df1)
print(df2)
print(df3)